In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
data = Series(['one','two',np.nan,'four'])

In [3]:
data

0     one
1     two
2     NaN
3    four
dtype: object

In [5]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

0     one
1     two
3    four
dtype: object

In [7]:
dframe = DataFrame([[1,2,3],[np.nan,5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [8]:
dframe

    0   1   2
0   1   2   3
1 NaN   5   6
2   7 NaN   9
3 NaN NaN NaN

In [9]:
cdframe = dframe.dropna()

In [10]:
cdframe

   0  1  2
0  1  2  3

In [11]:
dframe.dropna(how='all')

    0   1  2
0   1   2  3
1 NaN   5  6
2   7 NaN  9

In [12]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [13]:
npn = np.nan
dframe2 = DataFrame([[1,2,3,npn],[2,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])

In [14]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [16]:
dframe.dropna(thresh=3)

   0  1  2
0  1  2  3

dframe2

In [17]:
dframe2

    0   1   2   3
0   1   2   3 NaN
1   2 NaN   5   6
2 NaN   7 NaN   9
3   1 NaN NaN NaN

In [18]:
dframe.fillna(1)

   0  1  2
0  1  2  3
1  1  5  6
2  7  1  9
3  1  1  1

In [19]:
dframe2.fillna({0:0,1:1,2:2,3:3})

   0  1  2  3
0  1  2  3  3
1  2  1  5  6
2  0  7  2  9
3  1  1  2  3

In [20]:
#dframe.fillna(0,inplace=True)

In [21]:
from numpy.random import randn

In [22]:
ser = Series(randn(6),index = [[1,1,1,2,2,2],['a','b','c','a','b','c']])

In [23]:
ser

1  a   -0.777005
   b    1.126272
   c    1.440451
2  a   -1.574741
   b    0.347683
   c   -0.960902
dtype: float64

In [24]:
ser[1]

a   -0.777005
b    1.126272
c    1.440451
dtype: float64

In [25]:
ser[1]['a']

-0.77700534816951572

In [29]:
dframe = ser.unstack()

In [30]:
dframe

          a         b         c
1 -0.777005  1.126272  1.440451
2 -1.574741  0.347683 -0.960902

In [33]:
dframe2 = DataFrame(np.arange(16).reshape(4,4),index = [['a','a','b','b'],[1,2,1,2]], columns=[['NY','NY','LA','SF'],['hot','cold','hot','cold']])

In [36]:
dframe2

       NY       LA   SF
      hot cold hot cold
I1 I2
a  1    0    1   2    3
   2    4    5   6    7
b  1    8    9  10   11
   2   12   13  14   15

In [37]:
dframe2.index.names = ['I1','I2']
dframe2.columns.names = ['cities','temp']
dframe2

cities  NY       LA   SF
temp   hot cold hot cold
I1 I2
a  1     0    1   2    3
   2     4    5   6    7
b  1     8    9  10   11
   2    12   13  14   15

In [39]:
dframe2.swaplevel('cities','temp',axis=1)

temp   hot cold hot cold
cities  NY   NY  LA   SF
I1 I2
a  1     0    1   2    3
   2     4    5   6    7
b  1     8    9  10   11
   2    12   13  14   15

In [40]:
dframe2.sortlevel(1)

cities  NY       LA   SF
temp   hot cold hot cold
I1 I2
a  1     0    1   2    3
b  1     8    9  10   11
a  2     4    5   6    7
b  2    12   13  14   15

In [43]:
dframe2.sum(level='temp',axis=1)

temp   cold  hot
I1 I2
a  1      4    2
   2     12   10
b  1     20   18
   2     28   26